Revit 2024 API
EnergyAnalysisConstruction.Description Property
 The description of the construction.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public string Description { get; }
Visual Basic
Public ReadOnly Property Description As String
	Get
Visual C++
public:
property String^ Description {
	String^ get ();
}
See Also
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace